Tekla Open API Reference for Tekla Structures 2025
Events.LayoutOptionModified Event
 The event is raised when layout option is modified
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event LayoutOptionModifiedDelegate LayoutOptionModified
Public Event LayoutOptionModified As LayoutOptionModifiedDelegate
Value
Type: LayoutOptionModifiedDelegate
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace